virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/udp.h
/*
 * Component description for UDP
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-07-26T14:35:51Z */
#ifndef _SAMG55_UDP_COMPONENT_H_
#define _SAMG55_UDP_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UDP                                          */
/* ************************************************************************** */

/* -------- UDP_FRM_NUM : (UDP Offset: 0x00) ( R/ 32) Frame Number Register -------- */
#define UDP_FRM_NUM_FRM_NUM_Pos               _U_(0)                                               /**< (UDP_FRM_NUM) Frame Number as Defined in the Packet Field Formats Position */
#define UDP_FRM_NUM_FRM_NUM_Msk               (_U_(0x7FF) << UDP_FRM_NUM_FRM_NUM_Pos)              /**< (UDP_FRM_NUM) Frame Number as Defined in the Packet Field Formats Mask */
#define UDP_FRM_NUM_FRM_NUM(value)            (UDP_FRM_NUM_FRM_NUM_Msk & ((value) << UDP_FRM_NUM_FRM_NUM_Pos))
#define UDP_FRM_NUM_FRM_ERR_Pos               _U_(16)                                              /**< (UDP_FRM_NUM) Frame Error Position */
#define UDP_FRM_NUM_FRM_ERR_Msk               (_U_(0x1) << UDP_FRM_NUM_FRM_ERR_Pos)                /**< (UDP_FRM_NUM) Frame Error Mask */
#define UDP_FRM_NUM_FRM_ERR(value)            (UDP_FRM_NUM_FRM_ERR_Msk & ((value) << UDP_FRM_NUM_FRM_ERR_Pos))
#define UDP_FRM_NUM_FRM_OK_Pos                _U_(17)                                              /**< (UDP_FRM_NUM) Frame OK Position */
#define UDP_FRM_NUM_FRM_OK_Msk                (_U_(0x1) << UDP_FRM_NUM_FRM_OK_Pos)                 /**< (UDP_FRM_NUM) Frame OK Mask */
#define UDP_FRM_NUM_FRM_OK(value)             (UDP_FRM_NUM_FRM_OK_Msk & ((value) << UDP_FRM_NUM_FRM_OK_Pos))
#define UDP_FRM_NUM_Msk                       _U_(0x000307FF)                                      /**< (UDP_FRM_NUM) Register Mask  */


/* -------- UDP_GLB_STAT : (UDP Offset: 0x04) (R/W 32) Global State Register -------- */
#define UDP_GLB_STAT_FADDEN_Pos               _U_(0)                                               /**< (UDP_GLB_STAT) Function Address Enable Position */
#define UDP_GLB_STAT_FADDEN_Msk               (_U_(0x1) << UDP_GLB_STAT_FADDEN_Pos)                /**< (UDP_GLB_STAT) Function Address Enable Mask */
#define UDP_GLB_STAT_FADDEN(value)            (UDP_GLB_STAT_FADDEN_Msk & ((value) << UDP_GLB_STAT_FADDEN_Pos))
#define UDP_GLB_STAT_CONFG_Pos                _U_(1)                                               /**< (UDP_GLB_STAT) Configured Position */
#define UDP_GLB_STAT_CONFG_Msk                (_U_(0x1) << UDP_GLB_STAT_CONFG_Pos)                 /**< (UDP_GLB_STAT) Configured Mask */
#define UDP_GLB_STAT_CONFG(value)             (UDP_GLB_STAT_CONFG_Msk & ((value) << UDP_GLB_STAT_CONFG_Pos))
#define UDP_GLB_STAT_ESR_Pos                  _U_(2)                                               /**< (UDP_GLB_STAT) Enable Send Resume Position */
#define UDP_GLB_STAT_ESR_Msk                  (_U_(0x1) << UDP_GLB_STAT_ESR_Pos)                   /**< (UDP_GLB_STAT) Enable Send Resume Mask */
#define UDP_GLB_STAT_ESR(value)               (UDP_GLB_STAT_ESR_Msk & ((value) << UDP_GLB_STAT_ESR_Pos))
#define UDP_GLB_STAT_RSMINPR_Pos              _U_(3)                                               /**< (UDP_GLB_STAT)  Position */
#define UDP_GLB_STAT_RSMINPR_Msk              (_U_(0x1) << UDP_GLB_STAT_RSMINPR_Pos)               /**< (UDP_GLB_STAT)  Mask */
#define UDP_GLB_STAT_RSMINPR(value)           (UDP_GLB_STAT_RSMINPR_Msk & ((value) << UDP_GLB_STAT_RSMINPR_Pos))
#define UDP_GLB_STAT_RMWUPE_Pos               _U_(4)                                               /**< (UDP_GLB_STAT) Remote Wakeup Enable Position */
#define UDP_GLB_STAT_RMWUPE_Msk               (_U_(0x1) << UDP_GLB_STAT_RMWUPE_Pos)                /**< (UDP_GLB_STAT) Remote Wakeup Enable Mask */
#define UDP_GLB_STAT_RMWUPE(value)            (UDP_GLB_STAT_RMWUPE_Msk & ((value) << UDP_GLB_STAT_RMWUPE_Pos))
#define UDP_GLB_STAT_Msk                      _U_(0x0000001F)                                      /**< (UDP_GLB_STAT) Register Mask  */


/* -------- UDP_FADDR : (UDP Offset: 0x08) (R/W 32) Function Address Register -------- */
#define UDP_FADDR_FADD_Pos                    _U_(0)                                               /**< (UDP_FADDR) Function Address Value Position */
#define UDP_FADDR_FADD_Msk                    (_U_(0x7F) << UDP_FADDR_FADD_Pos)                    /**< (UDP_FADDR) Function Address Value Mask */
#define UDP_FADDR_FADD(value)                 (UDP_FADDR_FADD_Msk & ((value) << UDP_FADDR_FADD_Pos))
#define UDP_FADDR_FEN_Pos                     _U_(8)                                               /**< (UDP_FADDR) Function Enable Position */
#define UDP_FADDR_FEN_Msk                     (_U_(0x1) << UDP_FADDR_FEN_Pos)                      /**< (UDP_FADDR) Function Enable Mask */
#define UDP_FADDR_FEN(value)                  (UDP_FADDR_FEN_Msk & ((value) << UDP_FADDR_FEN_Pos))
#define UDP_FADDR_Msk                         _U_(0x0000017F)                                      /**< (UDP_FADDR) Register Mask  */


/* -------- UDP_IER : (UDP Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define UDP_IER_EP0INT_Pos                    _U_(0)                                               /**< (UDP_IER) Enable Endpoint 0 Interrupt Position */
#define UDP_IER_EP0INT_Msk                    (_U_(0x1) << UDP_IER_EP0INT_Pos)                     /**< (UDP_IER) Enable Endpoint 0 Interrupt Mask */
#define UDP_IER_EP0INT(value)                 (UDP_IER_EP0INT_Msk & ((value) << UDP_IER_EP0INT_Pos))
#define UDP_IER_EP1INT_Pos                    _U_(1)                                               /**< (UDP_IER) Enable Endpoint 1 Interrupt Position */
#define UDP_IER_EP1INT_Msk                    (_U_(0x1) << UDP_IER_EP1INT_Pos)                     /**< (UDP_IER) Enable Endpoint 1 Interrupt Mask */
#define UDP_IER_EP1INT(value)                 (UDP_IER_EP1INT_Msk & ((value) << UDP_IER_EP1INT_Pos))
#define UDP_IER_EP2INT_Pos                    _U_(2)                                               /**< (UDP_IER) Enable Endpoint 2Interrupt Position */
#define UDP_IER_EP2INT_Msk                    (_U_(0x1) << UDP_IER_EP2INT_Pos)                     /**< (UDP_IER) Enable Endpoint 2Interrupt Mask */
#define UDP_IER_EP2INT(value)                 (UDP_IER_EP2INT_Msk & ((value) << UDP_IER_EP2INT_Pos))
#define UDP_IER_EP3INT_Pos                    _U_(3)                                               /**< (UDP_IER) Enable Endpoint 3 Interrupt Position */
#define UDP_IER_EP3INT_Msk                    (_U_(0x1) << UDP_IER_EP3INT_Pos)                     /**< (UDP_IER) Enable Endpoint 3 Interrupt Mask */
#define UDP_IER_EP3INT(value)                 (UDP_IER_EP3INT_Msk & ((value) << UDP_IER_EP3INT_Pos))
#define UDP_IER_EP4INT_Pos                    _U_(4)                                               /**< (UDP_IER) Enable Endpoint 4 Interrupt Position */
#define UDP_IER_EP4INT_Msk                    (_U_(0x1) << UDP_IER_EP4INT_Pos)                     /**< (UDP_IER) Enable Endpoint 4 Interrupt Mask */
#define UDP_IER_EP4INT(value)                 (UDP_IER_EP4INT_Msk & ((value) << UDP_IER_EP4INT_Pos))
#define UDP_IER_EP5INT_Pos                    _U_(5)                                               /**< (UDP_IER) Enable Endpoint 5 Interrupt Position */
#define UDP_IER_EP5INT_Msk                    (_U_(0x1) << UDP_IER_EP5INT_Pos)                     /**< (UDP_IER) Enable Endpoint 5 Interrupt Mask */
#define UDP_IER_EP5INT(value)                 (UDP_IER_EP5INT_Msk & ((value) << UDP_IER_EP5INT_Pos))
#define UDP_IER_RXSUSP_Pos                    _U_(8)                                               /**< (UDP_IER) Enable UDP Suspend Interrupt Position */
#define UDP_IER_RXSUSP_Msk                    (_U_(0x1) << UDP_IER_RXSUSP_Pos)                     /**< (UDP_IER) Enable UDP Suspend Interrupt Mask */
#define UDP_IER_RXSUSP(value)                 (UDP_IER_RXSUSP_Msk & ((value) << UDP_IER_RXSUSP_Pos))
#define UDP_IER_RXRSM_Pos                     _U_(9)                                               /**< (UDP_IER) Enable UDP Resume Interrupt Position */
#define UDP_IER_RXRSM_Msk                     (_U_(0x1) << UDP_IER_RXRSM_Pos)                      /**< (UDP_IER) Enable UDP Resume Interrupt Mask */
#define UDP_IER_RXRSM(value)                  (UDP_IER_RXRSM_Msk & ((value) << UDP_IER_RXRSM_Pos))
#define UDP_IER_EXTRSM_Pos                    _U_(10)                                              /**< (UDP_IER)  Position */
#define UDP_IER_EXTRSM_Msk                    (_U_(0x1) << UDP_IER_EXTRSM_Pos)                     /**< (UDP_IER)  Mask */
#define UDP_IER_EXTRSM(value)                 (UDP_IER_EXTRSM_Msk & ((value) << UDP_IER_EXTRSM_Pos))
#define UDP_IER_SOFINT_Pos                    _U_(11)                                              /**< (UDP_IER) Enable Start Of Frame Interrupt Position */
#define UDP_IER_SOFINT_Msk                    (_U_(0x1) << UDP_IER_SOFINT_Pos)                     /**< (UDP_IER) Enable Start Of Frame Interrupt Mask */
#define UDP_IER_SOFINT(value)                 (UDP_IER_SOFINT_Msk & ((value) << UDP_IER_SOFINT_Pos))
#define UDP_IER_WAKEUP_Pos                    _U_(13)                                              /**< (UDP_IER) Enable UDP Bus Wakeup Interrupt Position */
#define UDP_IER_WAKEUP_Msk                    (_U_(0x1) << UDP_IER_WAKEUP_Pos)                     /**< (UDP_IER) Enable UDP Bus Wakeup Interrupt Mask */
#define UDP_IER_WAKEUP(value)                 (UDP_IER_WAKEUP_Msk & ((value) << UDP_IER_WAKEUP_Pos))
#define UDP_IER_Msk                           _U_(0x00002F3F)                                      /**< (UDP_IER) Register Mask  */


/* -------- UDP_IDR : (UDP Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define UDP_IDR_EP0INT_Pos                    _U_(0)                                               /**< (UDP_IDR) Disable Endpoint 0 Interrupt Position */
#define UDP_IDR_EP0INT_Msk                    (_U_(0x1) << UDP_IDR_EP0INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 0 Interrupt Mask */
#define UDP_IDR_EP0INT(value)                 (UDP_IDR_EP0INT_Msk & ((value) << UDP_IDR_EP0INT_Pos))
#define UDP_IDR_EP1INT_Pos                    _U_(1)                                               /**< (UDP_IDR) Disable Endpoint 1 Interrupt Position */
#define UDP_IDR_EP1INT_Msk                    (_U_(0x1) << UDP_IDR_EP1INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 1 Interrupt Mask */
#define UDP_IDR_EP1INT(value)                 (UDP_IDR_EP1INT_Msk & ((value) << UDP_IDR_EP1INT_Pos))
#define UDP_IDR_EP2INT_Pos                    _U_(2)                                               /**< (UDP_IDR) Disable Endpoint 2 Interrupt Position */
#define UDP_IDR_EP2INT_Msk                    (_U_(0x1) << UDP_IDR_EP2INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 2 Interrupt Mask */
#define UDP_IDR_EP2INT(value)                 (UDP_IDR_EP2INT_Msk & ((value) << UDP_IDR_EP2INT_Pos))
#define UDP_IDR_EP3INT_Pos                    _U_(3)                                               /**< (UDP_IDR) Disable Endpoint 3 Interrupt Position */
#define UDP_IDR_EP3INT_Msk                    (_U_(0x1) << UDP_IDR_EP3INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 3 Interrupt Mask */
#define UDP_IDR_EP3INT(value)                 (UDP_IDR_EP3INT_Msk & ((value) << UDP_IDR_EP3INT_Pos))
#define UDP_IDR_EP4INT_Pos                    _U_(4)                                               /**< (UDP_IDR) Disable Endpoint 4 Interrupt Position */
#define UDP_IDR_EP4INT_Msk                    (_U_(0x1) << UDP_IDR_EP4INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 4 Interrupt Mask */
#define UDP_IDR_EP4INT(value)                 (UDP_IDR_EP4INT_Msk & ((value) << UDP_IDR_EP4INT_Pos))
#define UDP_IDR_EP5INT_Pos                    _U_(5)                                               /**< (UDP_IDR) Disable Endpoint 5 Interrupt Position */
#define UDP_IDR_EP5INT_Msk                    (_U_(0x1) << UDP_IDR_EP5INT_Pos)                     /**< (UDP_IDR) Disable Endpoint 5 Interrupt Mask */
#define UDP_IDR_EP5INT(value)                 (UDP_IDR_EP5INT_Msk & ((value) << UDP_IDR_EP5INT_Pos))
#define UDP_IDR_RXSUSP_Pos                    _U_(8)                                               /**< (UDP_IDR) Disable UDP Suspend Interrupt Position */
#define UDP_IDR_RXSUSP_Msk                    (_U_(0x1) << UDP_IDR_RXSUSP_Pos)                     /**< (UDP_IDR) Disable UDP Suspend Interrupt Mask */
#define UDP_IDR_RXSUSP(value)                 (UDP_IDR_RXSUSP_Msk & ((value) << UDP_IDR_RXSUSP_Pos))
#define UDP_IDR_RXRSM_Pos                     _U_(9)                                               /**< (UDP_IDR) Disable UDP Resume Interrupt Position */
#define UDP_IDR_RXRSM_Msk                     (_U_(0x1) << UDP_IDR_RXRSM_Pos)                      /**< (UDP_IDR) Disable UDP Resume Interrupt Mask */
#define UDP_IDR_RXRSM(value)                  (UDP_IDR_RXRSM_Msk & ((value) << UDP_IDR_RXRSM_Pos))
#define UDP_IDR_EXTRSM_Pos                    _U_(10)                                              /**< (UDP_IDR)  Position */
#define UDP_IDR_EXTRSM_Msk                    (_U_(0x1) << UDP_IDR_EXTRSM_Pos)                     /**< (UDP_IDR)  Mask */
#define UDP_IDR_EXTRSM(value)                 (UDP_IDR_EXTRSM_Msk & ((value) << UDP_IDR_EXTRSM_Pos))
#define UDP_IDR_SOFINT_Pos                    _U_(11)                                              /**< (UDP_IDR) Disable Start Of Frame Interrupt Position */
#define UDP_IDR_SOFINT_Msk                    (_U_(0x1) << UDP_IDR_SOFINT_Pos)                     /**< (UDP_IDR) Disable Start Of Frame Interrupt Mask */
#define UDP_IDR_SOFINT(value)                 (UDP_IDR_SOFINT_Msk & ((value) << UDP_IDR_SOFINT_Pos))
#define UDP_IDR_WAKEUP_Pos                    _U_(13)                                              /**< (UDP_IDR) Disable USB Bus Interrupt Position */
#define UDP_IDR_WAKEUP_Msk                    (_U_(0x1) << UDP_IDR_WAKEUP_Pos)                     /**< (UDP_IDR) Disable USB Bus Interrupt Mask */
#define UDP_IDR_WAKEUP(value)                 (UDP_IDR_WAKEUP_Msk & ((value) << UDP_IDR_WAKEUP_Pos))
#define UDP_IDR_Msk                           _U_(0x00002F3F)                                      /**< (UDP_IDR) Register Mask  */


/* -------- UDP_IMR : (UDP Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define UDP_IMR_EP0INT_Pos                    _U_(0)                                               /**< (UDP_IMR) Mask Endpoint 0 Interrupt Position */
#define UDP_IMR_EP0INT_Msk                    (_U_(0x1) << UDP_IMR_EP0INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 0 Interrupt Mask */
#define UDP_IMR_EP0INT(value)                 (UDP_IMR_EP0INT_Msk & ((value) << UDP_IMR_EP0INT_Pos))
#define UDP_IMR_EP1INT_Pos                    _U_(1)                                               /**< (UDP_IMR) Mask Endpoint 1 Interrupt Position */
#define UDP_IMR_EP1INT_Msk                    (_U_(0x1) << UDP_IMR_EP1INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 1 Interrupt Mask */
#define UDP_IMR_EP1INT(value)                 (UDP_IMR_EP1INT_Msk & ((value) << UDP_IMR_EP1INT_Pos))
#define UDP_IMR_EP2INT_Pos                    _U_(2)                                               /**< (UDP_IMR) Mask Endpoint 2 Interrupt Position */
#define UDP_IMR_EP2INT_Msk                    (_U_(0x1) << UDP_IMR_EP2INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 2 Interrupt Mask */
#define UDP_IMR_EP2INT(value)                 (UDP_IMR_EP2INT_Msk & ((value) << UDP_IMR_EP2INT_Pos))
#define UDP_IMR_EP3INT_Pos                    _U_(3)                                               /**< (UDP_IMR) Mask Endpoint 3 Interrupt Position */
#define UDP_IMR_EP3INT_Msk                    (_U_(0x1) << UDP_IMR_EP3INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 3 Interrupt Mask */
#define UDP_IMR_EP3INT(value)                 (UDP_IMR_EP3INT_Msk & ((value) << UDP_IMR_EP3INT_Pos))
#define UDP_IMR_EP4INT_Pos                    _U_(4)                                               /**< (UDP_IMR) Mask Endpoint 4 Interrupt Position */
#define UDP_IMR_EP4INT_Msk                    (_U_(0x1) << UDP_IMR_EP4INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 4 Interrupt Mask */
#define UDP_IMR_EP4INT(value)                 (UDP_IMR_EP4INT_Msk & ((value) << UDP_IMR_EP4INT_Pos))
#define UDP_IMR_EP5INT_Pos                    _U_(5)                                               /**< (UDP_IMR) Mask Endpoint 5 Interrupt Position */
#define UDP_IMR_EP5INT_Msk                    (_U_(0x1) << UDP_IMR_EP5INT_Pos)                     /**< (UDP_IMR) Mask Endpoint 5 Interrupt Mask */
#define UDP_IMR_EP5INT(value)                 (UDP_IMR_EP5INT_Msk & ((value) << UDP_IMR_EP5INT_Pos))
#define UDP_IMR_RXSUSP_Pos                    _U_(8)                                               /**< (UDP_IMR) Mask UDP Suspend Interrupt Position */
#define UDP_IMR_RXSUSP_Msk                    (_U_(0x1) << UDP_IMR_RXSUSP_Pos)                     /**< (UDP_IMR) Mask UDP Suspend Interrupt Mask */
#define UDP_IMR_RXSUSP(value)                 (UDP_IMR_RXSUSP_Msk & ((value) << UDP_IMR_RXSUSP_Pos))
#define UDP_IMR_RXRSM_Pos                     _U_(9)                                               /**< (UDP_IMR) Mask UDP Resume Interrupt. Position */
#define UDP_IMR_RXRSM_Msk                     (_U_(0x1) << UDP_IMR_RXRSM_Pos)                      /**< (UDP_IMR) Mask UDP Resume Interrupt. Mask */
#define UDP_IMR_RXRSM(value)                  (UDP_IMR_RXRSM_Msk & ((value) << UDP_IMR_RXRSM_Pos))
#define UDP_IMR_EXTRSM_Pos                    _U_(10)                                              /**< (UDP_IMR)  Position */
#define UDP_IMR_EXTRSM_Msk                    (_U_(0x1) << UDP_IMR_EXTRSM_Pos)                     /**< (UDP_IMR)  Mask */
#define UDP_IMR_EXTRSM(value)                 (UDP_IMR_EXTRSM_Msk & ((value) << UDP_IMR_EXTRSM_Pos))
#define UDP_IMR_SOFINT_Pos                    _U_(11)                                              /**< (UDP_IMR) Mask Start Of Frame Interrupt Position */
#define UDP_IMR_SOFINT_Msk                    (_U_(0x1) << UDP_IMR_SOFINT_Pos)                     /**< (UDP_IMR) Mask Start Of Frame Interrupt Mask */
#define UDP_IMR_SOFINT(value)                 (UDP_IMR_SOFINT_Msk & ((value) << UDP_IMR_SOFINT_Pos))
#define UDP_IMR_BIT12_Pos                     _U_(12)                                              /**< (UDP_IMR) UDP_IMR Bit 12 Position */
#define UDP_IMR_BIT12_Msk                     (_U_(0x1) << UDP_IMR_BIT12_Pos)                      /**< (UDP_IMR) UDP_IMR Bit 12 Mask */
#define UDP_IMR_BIT12(value)                  (UDP_IMR_BIT12_Msk & ((value) << UDP_IMR_BIT12_Pos))
#define UDP_IMR_WAKEUP_Pos                    _U_(13)                                              /**< (UDP_IMR) USB Bus Wakeup Interrupt Position */
#define UDP_IMR_WAKEUP_Msk                    (_U_(0x1) << UDP_IMR_WAKEUP_Pos)                     /**< (UDP_IMR) USB Bus Wakeup Interrupt Mask */
#define UDP_IMR_WAKEUP(value)                 (UDP_IMR_WAKEUP_Msk & ((value) << UDP_IMR_WAKEUP_Pos))
#define UDP_IMR_Msk                           _U_(0x00003F3F)                                      /**< (UDP_IMR) Register Mask  */

#define UDP_IMR_BIT_Pos                       _U_(12)                                              /**< (UDP_IMR Position) UDP_IMR Bit x2 */
#define UDP_IMR_BIT_Msk                       (_U_(0x1) << UDP_IMR_BIT_Pos)                        /**< (UDP_IMR Mask) BIT */
#define UDP_IMR_BIT(value)                    (UDP_IMR_BIT_Msk & ((value) << UDP_IMR_BIT_Pos))     

