virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/udp.h
/* -------- UDP_ISR : (UDP Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define UDP_ISR_EP0INT_Pos                    _U_(0)                                               /**< (UDP_ISR) Endpoint 0 Interrupt Status Position */
#define UDP_ISR_EP0INT_Msk                    (_U_(0x1) << UDP_ISR_EP0INT_Pos)                     /**< (UDP_ISR) Endpoint 0 Interrupt Status Mask */
#define UDP_ISR_EP0INT(value)                 (UDP_ISR_EP0INT_Msk & ((value) << UDP_ISR_EP0INT_Pos))
#define UDP_ISR_EP1INT_Pos                    _U_(1)                                               /**< (UDP_ISR) Endpoint 1 Interrupt Status Position */
#define UDP_ISR_EP1INT_Msk                    (_U_(0x1) << UDP_ISR_EP1INT_Pos)                     /**< (UDP_ISR) Endpoint 1 Interrupt Status Mask */
#define UDP_ISR_EP1INT(value)                 (UDP_ISR_EP1INT_Msk & ((value) << UDP_ISR_EP1INT_Pos))
#define UDP_ISR_EP2INT_Pos                    _U_(2)                                               /**< (UDP_ISR) Endpoint 2 Interrupt Status Position */
#define UDP_ISR_EP2INT_Msk                    (_U_(0x1) << UDP_ISR_EP2INT_Pos)                     /**< (UDP_ISR) Endpoint 2 Interrupt Status Mask */
#define UDP_ISR_EP2INT(value)                 (UDP_ISR_EP2INT_Msk & ((value) << UDP_ISR_EP2INT_Pos))
#define UDP_ISR_EP3INT_Pos                    _U_(3)                                               /**< (UDP_ISR) Endpoint 3 Interrupt Status Position */
#define UDP_ISR_EP3INT_Msk                    (_U_(0x1) << UDP_ISR_EP3INT_Pos)                     /**< (UDP_ISR) Endpoint 3 Interrupt Status Mask */
#define UDP_ISR_EP3INT(value)                 (UDP_ISR_EP3INT_Msk & ((value) << UDP_ISR_EP3INT_Pos))
#define UDP_ISR_EP4INT_Pos                    _U_(4)                                               /**< (UDP_ISR) Endpoint 4 Interrupt Status Position */
#define UDP_ISR_EP4INT_Msk                    (_U_(0x1) << UDP_ISR_EP4INT_Pos)                     /**< (UDP_ISR) Endpoint 4 Interrupt Status Mask */
#define UDP_ISR_EP4INT(value)                 (UDP_ISR_EP4INT_Msk & ((value) << UDP_ISR_EP4INT_Pos))
#define UDP_ISR_EP5INT_Pos                    _U_(5)                                               /**< (UDP_ISR) Endpoint 5 Interrupt Status Position */
#define UDP_ISR_EP5INT_Msk                    (_U_(0x1) << UDP_ISR_EP5INT_Pos)                     /**< (UDP_ISR) Endpoint 5 Interrupt Status Mask */
#define UDP_ISR_EP5INT(value)                 (UDP_ISR_EP5INT_Msk & ((value) << UDP_ISR_EP5INT_Pos))
#define UDP_ISR_RXSUSP_Pos                    _U_(8)                                               /**< (UDP_ISR) UDP Suspend Interrupt Status Position */
#define UDP_ISR_RXSUSP_Msk                    (_U_(0x1) << UDP_ISR_RXSUSP_Pos)                     /**< (UDP_ISR) UDP Suspend Interrupt Status Mask */
#define UDP_ISR_RXSUSP(value)                 (UDP_ISR_RXSUSP_Msk & ((value) << UDP_ISR_RXSUSP_Pos))
#define UDP_ISR_RXRSM_Pos                     _U_(9)                                               /**< (UDP_ISR) UDP Resume Interrupt Status Position */
#define UDP_ISR_RXRSM_Msk                     (_U_(0x1) << UDP_ISR_RXRSM_Pos)                      /**< (UDP_ISR) UDP Resume Interrupt Status Mask */
#define UDP_ISR_RXRSM(value)                  (UDP_ISR_RXRSM_Msk & ((value) << UDP_ISR_RXRSM_Pos))
#define UDP_ISR_EXTRSM_Pos                    _U_(10)                                              /**< (UDP_ISR)  Position */
#define UDP_ISR_EXTRSM_Msk                    (_U_(0x1) << UDP_ISR_EXTRSM_Pos)                     /**< (UDP_ISR)  Mask */
#define UDP_ISR_EXTRSM(value)                 (UDP_ISR_EXTRSM_Msk & ((value) << UDP_ISR_EXTRSM_Pos))
#define UDP_ISR_SOFINT_Pos                    _U_(11)                                              /**< (UDP_ISR) Start of Frame Interrupt Status Position */
#define UDP_ISR_SOFINT_Msk                    (_U_(0x1) << UDP_ISR_SOFINT_Pos)                     /**< (UDP_ISR) Start of Frame Interrupt Status Mask */
#define UDP_ISR_SOFINT(value)                 (UDP_ISR_SOFINT_Msk & ((value) << UDP_ISR_SOFINT_Pos))
#define UDP_ISR_ENDBUSRES_Pos                 _U_(12)                                              /**< (UDP_ISR) End of BUS Reset Interrupt Status Position */
#define UDP_ISR_ENDBUSRES_Msk                 (_U_(0x1) << UDP_ISR_ENDBUSRES_Pos)                  /**< (UDP_ISR) End of BUS Reset Interrupt Status Mask */
#define UDP_ISR_ENDBUSRES(value)              (UDP_ISR_ENDBUSRES_Msk & ((value) << UDP_ISR_ENDBUSRES_Pos))
#define UDP_ISR_WAKEUP_Pos                    _U_(13)                                              /**< (UDP_ISR) UDP Resume Interrupt Status Position */
#define UDP_ISR_WAKEUP_Msk                    (_U_(0x1) << UDP_ISR_WAKEUP_Pos)                     /**< (UDP_ISR) UDP Resume Interrupt Status Mask */
#define UDP_ISR_WAKEUP(value)                 (UDP_ISR_WAKEUP_Msk & ((value) << UDP_ISR_WAKEUP_Pos))
#define UDP_ISR_Msk                           _U_(0x00003F3F)                                      /**< (UDP_ISR) Register Mask  */


/* -------- UDP_ICR : (UDP Offset: 0x20) ( /W 32) Interrupt Clear Register -------- */
#define UDP_ICR_RXSUSP_Pos                    _U_(8)                                               /**< (UDP_ICR) Clear UDP Suspend Interrupt Position */
#define UDP_ICR_RXSUSP_Msk                    (_U_(0x1) << UDP_ICR_RXSUSP_Pos)                     /**< (UDP_ICR) Clear UDP Suspend Interrupt Mask */
#define UDP_ICR_RXSUSP(value)                 (UDP_ICR_RXSUSP_Msk & ((value) << UDP_ICR_RXSUSP_Pos))
#define UDP_ICR_RXRSM_Pos                     _U_(9)                                               /**< (UDP_ICR) Clear UDP Resume Interrupt Position */
#define UDP_ICR_RXRSM_Msk                     (_U_(0x1) << UDP_ICR_RXRSM_Pos)                      /**< (UDP_ICR) Clear UDP Resume Interrupt Mask */
#define UDP_ICR_RXRSM(value)                  (UDP_ICR_RXRSM_Msk & ((value) << UDP_ICR_RXRSM_Pos))
#define UDP_ICR_EXTRSM_Pos                    _U_(10)                                              /**< (UDP_ICR)  Position */
#define UDP_ICR_EXTRSM_Msk                    (_U_(0x1) << UDP_ICR_EXTRSM_Pos)                     /**< (UDP_ICR)  Mask */
#define UDP_ICR_EXTRSM(value)                 (UDP_ICR_EXTRSM_Msk & ((value) << UDP_ICR_EXTRSM_Pos))
#define UDP_ICR_SOFINT_Pos                    _U_(11)                                              /**< (UDP_ICR) Clear Start Of Frame Interrupt Position */
#define UDP_ICR_SOFINT_Msk                    (_U_(0x1) << UDP_ICR_SOFINT_Pos)                     /**< (UDP_ICR) Clear Start Of Frame Interrupt Mask */
#define UDP_ICR_SOFINT(value)                 (UDP_ICR_SOFINT_Msk & ((value) << UDP_ICR_SOFINT_Pos))
#define UDP_ICR_ENDBUSRES_Pos                 _U_(12)                                              /**< (UDP_ICR) Clear End of Bus Reset Interrupt Position */
#define UDP_ICR_ENDBUSRES_Msk                 (_U_(0x1) << UDP_ICR_ENDBUSRES_Pos)                  /**< (UDP_ICR) Clear End of Bus Reset Interrupt Mask */
#define UDP_ICR_ENDBUSRES(value)              (UDP_ICR_ENDBUSRES_Msk & ((value) << UDP_ICR_ENDBUSRES_Pos))
#define UDP_ICR_WAKEUP_Pos                    _U_(13)                                              /**< (UDP_ICR) Clear Wakeup Interrupt Position */
#define UDP_ICR_WAKEUP_Msk                    (_U_(0x1) << UDP_ICR_WAKEUP_Pos)                     /**< (UDP_ICR) Clear Wakeup Interrupt Mask */
#define UDP_ICR_WAKEUP(value)                 (UDP_ICR_WAKEUP_Msk & ((value) << UDP_ICR_WAKEUP_Pos))
#define UDP_ICR_Msk                           _U_(0x00003F00)                                      /**< (UDP_ICR) Register Mask  */


/* -------- UDP_RST_EP : (UDP Offset: 0x28) (R/W 32) Reset Endpoint Register -------- */
#define UDP_RST_EP_EP0_Pos                    _U_(0)                                               /**< (UDP_RST_EP) Reset Endpoint 0 Position */
#define UDP_RST_EP_EP0_Msk                    (_U_(0x1) << UDP_RST_EP_EP0_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 0 Mask */
#define UDP_RST_EP_EP0(value)                 (UDP_RST_EP_EP0_Msk & ((value) << UDP_RST_EP_EP0_Pos))
#define UDP_RST_EP_EP1_Pos                    _U_(1)                                               /**< (UDP_RST_EP) Reset Endpoint 1 Position */
#define UDP_RST_EP_EP1_Msk                    (_U_(0x1) << UDP_RST_EP_EP1_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 1 Mask */
#define UDP_RST_EP_EP1(value)                 (UDP_RST_EP_EP1_Msk & ((value) << UDP_RST_EP_EP1_Pos))
#define UDP_RST_EP_EP2_Pos                    _U_(2)                                               /**< (UDP_RST_EP) Reset Endpoint 2 Position */
#define UDP_RST_EP_EP2_Msk                    (_U_(0x1) << UDP_RST_EP_EP2_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 2 Mask */
#define UDP_RST_EP_EP2(value)                 (UDP_RST_EP_EP2_Msk & ((value) << UDP_RST_EP_EP2_Pos))
#define UDP_RST_EP_EP3_Pos                    _U_(3)                                               /**< (UDP_RST_EP) Reset Endpoint 3 Position */
#define UDP_RST_EP_EP3_Msk                    (_U_(0x1) << UDP_RST_EP_EP3_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 3 Mask */
#define UDP_RST_EP_EP3(value)                 (UDP_RST_EP_EP3_Msk & ((value) << UDP_RST_EP_EP3_Pos))
#define UDP_RST_EP_EP4_Pos                    _U_(4)                                               /**< (UDP_RST_EP) Reset Endpoint 4 Position */
#define UDP_RST_EP_EP4_Msk                    (_U_(0x1) << UDP_RST_EP_EP4_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 4 Mask */
#define UDP_RST_EP_EP4(value)                 (UDP_RST_EP_EP4_Msk & ((value) << UDP_RST_EP_EP4_Pos))
#define UDP_RST_EP_EP5_Pos                    _U_(5)                                               /**< (UDP_RST_EP) Reset Endpoint 5 Position */
#define UDP_RST_EP_EP5_Msk                    (_U_(0x1) << UDP_RST_EP_EP5_Pos)                     /**< (UDP_RST_EP) Reset Endpoint 5 Mask */
#define UDP_RST_EP_EP5(value)                 (UDP_RST_EP_EP5_Msk & ((value) << UDP_RST_EP_EP5_Pos))
#define UDP_RST_EP_Msk                        _U_(0x0000003F)                                      /**< (UDP_RST_EP) Register Mask  */

#define UDP_RST_EP_EP_Pos                     _U_(0)                                               /**< (UDP_RST_EP Position) Reset Endpoint 5 */
#define UDP_RST_EP_EP_Msk                     (_U_(0x3F) << UDP_RST_EP_EP_Pos)                     /**< (UDP_RST_EP Mask) EP */
#define UDP_RST_EP_EP(value)                  (UDP_RST_EP_EP_Msk & ((value) << UDP_RST_EP_EP_Pos)) 

/* -------- UDP_CSR : (UDP Offset: 0x30) (R/W 32) Endpoint Control and Status Register 0 -------- */
#define UDP_CSR_TXCOMP_Pos                    _U_(0)                                               /**< (UDP_CSR) Generates an IN Packet with Data Previously Written in the DPR Position */
#define UDP_CSR_TXCOMP_Msk                    (_U_(0x1) << UDP_CSR_TXCOMP_Pos)                     /**< (UDP_CSR) Generates an IN Packet with Data Previously Written in the DPR Mask */
#define UDP_CSR_TXCOMP(value)                 (UDP_CSR_TXCOMP_Msk & ((value) << UDP_CSR_TXCOMP_Pos))
#define UDP_CSR_RX_DATA_BK0_Pos               _U_(1)                                               /**< (UDP_CSR) Receive Data Bank 0 Position */
#define UDP_CSR_RX_DATA_BK0_Msk               (_U_(0x1) << UDP_CSR_RX_DATA_BK0_Pos)                /**< (UDP_CSR) Receive Data Bank 0 Mask */
#define UDP_CSR_RX_DATA_BK0(value)            (UDP_CSR_RX_DATA_BK0_Msk & ((value) << UDP_CSR_RX_DATA_BK0_Pos))
#define UDP_CSR_RXSETUP_Pos                   _U_(2)                                               /**< (UDP_CSR) Received Setup Position */
#define UDP_CSR_RXSETUP_Msk                   (_U_(0x1) << UDP_CSR_RXSETUP_Pos)                    /**< (UDP_CSR) Received Setup Mask */
#define UDP_CSR_RXSETUP(value)                (UDP_CSR_RXSETUP_Msk & ((value) << UDP_CSR_RXSETUP_Pos))
#define UDP_CSR_STALLSENT_Pos                 _U_(3)                                               /**< (UDP_CSR) Stall Sent Position */
#define UDP_CSR_STALLSENT_Msk                 (_U_(0x1) << UDP_CSR_STALLSENT_Pos)                  /**< (UDP_CSR) Stall Sent Mask */
#define UDP_CSR_STALLSENT(value)              (UDP_CSR_STALLSENT_Msk & ((value) << UDP_CSR_STALLSENT_Pos))
#define UDP_CSR_TXPKTRDY_Pos                  _U_(4)                                               /**< (UDP_CSR) Transmit Packet Ready Position */
#define UDP_CSR_TXPKTRDY_Msk                  (_U_(0x1) << UDP_CSR_TXPKTRDY_Pos)                   /**< (UDP_CSR) Transmit Packet Ready Mask */
#define UDP_CSR_TXPKTRDY(value)               (UDP_CSR_TXPKTRDY_Msk & ((value) << UDP_CSR_TXPKTRDY_Pos))
#define UDP_CSR_FORCESTALL_Pos                _U_(5)                                               /**< (UDP_CSR) Force Stall (used by Control, Bulk and Isochronous Endpoints) Position */
#define UDP_CSR_FORCESTALL_Msk                (_U_(0x1) << UDP_CSR_FORCESTALL_Pos)                 /**< (UDP_CSR) Force Stall (used by Control, Bulk and Isochronous Endpoints) Mask */
#define UDP_CSR_FORCESTALL(value)             (UDP_CSR_FORCESTALL_Msk & ((value) << UDP_CSR_FORCESTALL_Pos))
#define UDP_CSR_RX_DATA_BK1_Pos               _U_(6)                                               /**< (UDP_CSR) Receive Data Bank 1 (only used by endpoints with ping-pong attributes) Position */
#define UDP_CSR_RX_DATA_BK1_Msk               (_U_(0x1) << UDP_CSR_RX_DATA_BK1_Pos)                /**< (UDP_CSR) Receive Data Bank 1 (only used by endpoints with ping-pong attributes) Mask */
#define UDP_CSR_RX_DATA_BK1(value)            (UDP_CSR_RX_DATA_BK1_Msk & ((value) << UDP_CSR_RX_DATA_BK1_Pos))
#define UDP_CSR_DIR_Pos                       _U_(7)                                               /**< (UDP_CSR) Transfer Direction (only available for control endpoints) (Read/Write) Position */
#define UDP_CSR_DIR_Msk                       (_U_(0x1) << UDP_CSR_DIR_Pos)                        /**< (UDP_CSR) Transfer Direction (only available for control endpoints) (Read/Write) Mask */
#define UDP_CSR_DIR(value)                    (UDP_CSR_DIR_Msk & ((value) << UDP_CSR_DIR_Pos))    
#define UDP_CSR_EPTYPE_Pos                    _U_(8)                                               /**< (UDP_CSR) Endpoint Type (Read/Write) Position */
#define UDP_CSR_EPTYPE_Msk                    (_U_(0x7) << UDP_CSR_EPTYPE_Pos)                     /**< (UDP_CSR) Endpoint Type (Read/Write) Mask */
#define UDP_CSR_EPTYPE(value)                 (UDP_CSR_EPTYPE_Msk & ((value) << UDP_CSR_EPTYPE_Pos))
#define   UDP_CSR_EPTYPE_CTRL_Val             _U_(0x0)                                             /**< (UDP_CSR) Control  */
#define   UDP_CSR_EPTYPE_ISO_OUT_Val          _U_(0x1)                                             /**< (UDP_CSR) Isochronous OUT  */
#define   UDP_CSR_EPTYPE_BULK_OUT_Val         _U_(0x2)                                             /**< (UDP_CSR) Bulk OUT  */
#define   UDP_CSR_EPTYPE_INT_OUT_Val          _U_(0x3)                                             /**< (UDP_CSR) Interrupt OUT  */
#define   UDP_CSR_EPTYPE_ISO_IN_Val           _U_(0x5)                                             /**< (UDP_CSR) Isochronous IN  */
#define   UDP_CSR_EPTYPE_BULK_IN_Val          _U_(0x6)                                             /**< (UDP_CSR) Bulk IN  */
#define   UDP_CSR_EPTYPE_INT_IN_Val           _U_(0x7)                                             /**< (UDP_CSR) Interrupt IN  */
#define UDP_CSR_EPTYPE_CTRL                   (UDP_CSR_EPTYPE_CTRL_Val << UDP_CSR_EPTYPE_Pos)      /**< (UDP_CSR) Control Position  */
#define UDP_CSR_EPTYPE_ISO_OUT                (UDP_CSR_EPTYPE_ISO_OUT_Val << UDP_CSR_EPTYPE_Pos)   /**< (UDP_CSR) Isochronous OUT Position  */
#define UDP_CSR_EPTYPE_BULK_OUT               (UDP_CSR_EPTYPE_BULK_OUT_Val << UDP_CSR_EPTYPE_Pos)  /**< (UDP_CSR) Bulk OUT Position  */
#define UDP_CSR_EPTYPE_INT_OUT                (UDP_CSR_EPTYPE_INT_OUT_Val << UDP_CSR_EPTYPE_Pos)   /**< (UDP_CSR) Interrupt OUT Position  */
#define UDP_CSR_EPTYPE_ISO_IN                 (UDP_CSR_EPTYPE_ISO_IN_Val << UDP_CSR_EPTYPE_Pos)    /**< (UDP_CSR) Isochronous IN Position  */
#define UDP_CSR_EPTYPE_BULK_IN                (UDP_CSR_EPTYPE_BULK_IN_Val << UDP_CSR_EPTYPE_Pos)   /**< (UDP_CSR) Bulk IN Position  */
#define UDP_CSR_EPTYPE_INT_IN                 (UDP_CSR_EPTYPE_INT_IN_Val << UDP_CSR_EPTYPE_Pos)    /**< (UDP_CSR) Interrupt IN Position  */
#define UDP_CSR_DTGLE_Pos                     _U_(11)                                              /**< (UDP_CSR) Data Toggle (Read-only) Position */
#define UDP_CSR_DTGLE_Msk                     (_U_(0x1) << UDP_CSR_DTGLE_Pos)                      /**< (UDP_CSR) Data Toggle (Read-only) Mask */
#define UDP_CSR_DTGLE(value)                  (UDP_CSR_DTGLE_Msk & ((value) << UDP_CSR_DTGLE_Pos))
#define UDP_CSR_EPEDS_Pos                     _U_(15)                                              /**< (UDP_CSR) Endpoint Enable Disable Position */
#define UDP_CSR_EPEDS_Msk                     (_U_(0x1) << UDP_CSR_EPEDS_Pos)                      /**< (UDP_CSR) Endpoint Enable Disable Mask */
#define UDP_CSR_EPEDS(value)                  (UDP_CSR_EPEDS_Msk & ((value) << UDP_CSR_EPEDS_Pos))
#define UDP_CSR_RXBYTECNT_Pos                 _U_(16)                                              /**< (UDP_CSR) Number of Bytes Available in the FIFO (Read-only) Position */
#define UDP_CSR_RXBYTECNT_Msk                 (_U_(0x7FF) << UDP_CSR_RXBYTECNT_Pos)                /**< (UDP_CSR) Number of Bytes Available in the FIFO (Read-only) Mask */
#define UDP_CSR_RXBYTECNT(value)              (UDP_CSR_RXBYTECNT_Msk & ((value) << UDP_CSR_RXBYTECNT_Pos))
#define UDP_CSR_Msk                           _U_(0x07FF8FFF)                                      /**< (UDP_CSR) Register Mask  */


/* -------- UDP_FDR : (UDP Offset: 0x50) (R/W 32) Endpoint FIFO Data Register 0 -------- */
#define UDP_FDR_FIFO_DATA_Pos                 _U_(0)                                               /**< (UDP_FDR) FIFO Data Value Position */
#define UDP_FDR_FIFO_DATA_Msk                 (_U_(0xFF) << UDP_FDR_FIFO_DATA_Pos)                 /**< (UDP_FDR) FIFO Data Value Mask */
#define UDP_FDR_FIFO_DATA(value)              (UDP_FDR_FIFO_DATA_Msk & ((value) << UDP_FDR_FIFO_DATA_Pos))
#define UDP_FDR_Msk                           _U_(0x000000FF)                                      /**< (UDP_FDR) Register Mask  */


