virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/udp.h
/* -------- UDP_TXVC : (UDP Offset: 0x74) (R/W 32) Transceiver Control Register -------- */
#define UDP_TXVC_TXVDIS_Pos                   _U_(8)                                               /**< (UDP_TXVC) Transceiver Disable Position */
#define UDP_TXVC_TXVDIS_Msk                   (_U_(0x1) << UDP_TXVC_TXVDIS_Pos)                    /**< (UDP_TXVC) Transceiver Disable Mask */
#define UDP_TXVC_TXVDIS(value)                (UDP_TXVC_TXVDIS_Msk & ((value) << UDP_TXVC_TXVDIS_Pos))
#define UDP_TXVC_PUON_Pos                     _U_(9)                                               /**< (UDP_TXVC) Pull-up On Position */
#define UDP_TXVC_PUON_Msk                     (_U_(0x1) << UDP_TXVC_PUON_Pos)                      /**< (UDP_TXVC) Pull-up On Mask */
#define UDP_TXVC_PUON(value)                  (UDP_TXVC_PUON_Msk & ((value) << UDP_TXVC_PUON_Pos))
#define UDP_TXVC_Msk                          _U_(0x00000300)                                      /**< (UDP_TXVC) Register Mask  */


/** \brief UDP register offsets definitions */
#define UDP_FRM_NUM_REG_OFST           (0x00)              /**< (UDP_FRM_NUM) Frame Number Register Offset */
#define UDP_GLB_STAT_REG_OFST          (0x04)              /**< (UDP_GLB_STAT) Global State Register Offset */
#define UDP_FADDR_REG_OFST             (0x08)              /**< (UDP_FADDR) Function Address Register Offset */
#define UDP_IER_REG_OFST               (0x10)              /**< (UDP_IER) Interrupt Enable Register Offset */
#define UDP_IDR_REG_OFST               (0x14)              /**< (UDP_IDR) Interrupt Disable Register Offset */
#define UDP_IMR_REG_OFST               (0x18)              /**< (UDP_IMR) Interrupt Mask Register Offset */
#define UDP_ISR_REG_OFST               (0x1C)              /**< (UDP_ISR) Interrupt Status Register Offset */
#define UDP_ICR_REG_OFST               (0x20)              /**< (UDP_ICR) Interrupt Clear Register Offset */
#define UDP_RST_EP_REG_OFST            (0x28)              /**< (UDP_RST_EP) Reset Endpoint Register Offset */
#define UDP_CSR_REG_OFST               (0x30)              /**< (UDP_CSR) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR0_REG_OFST              (0x30)              /**< (UDP_CSR0) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR1_REG_OFST              (0x34)              /**< (UDP_CSR1) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR2_REG_OFST              (0x38)              /**< (UDP_CSR2) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR3_REG_OFST              (0x3C)              /**< (UDP_CSR3) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR4_REG_OFST              (0x40)              /**< (UDP_CSR4) Endpoint Control and Status Register 0 Offset */
#define UDP_CSR5_REG_OFST              (0x44)              /**< (UDP_CSR5) Endpoint Control and Status Register 0 Offset */
#define UDP_FDR_REG_OFST               (0x50)              /**< (UDP_FDR) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR0_REG_OFST              (0x50)              /**< (UDP_FDR0) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR1_REG_OFST              (0x54)              /**< (UDP_FDR1) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR2_REG_OFST              (0x58)              /**< (UDP_FDR2) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR3_REG_OFST              (0x5C)              /**< (UDP_FDR3) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR4_REG_OFST              (0x60)              /**< (UDP_FDR4) Endpoint FIFO Data Register 0 Offset */
#define UDP_FDR5_REG_OFST              (0x64)              /**< (UDP_FDR5) Endpoint FIFO Data Register 0 Offset */
#define UDP_TXVC_REG_OFST              (0x74)              /**< (UDP_TXVC) Transceiver Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UDP register API structure */
typedef struct
{
  __I   uint32_t                       UDP_FRM_NUM;        /**< Offset: 0x00 (R/   32) Frame Number Register */
  __IO  uint32_t                       UDP_GLB_STAT;       /**< Offset: 0x04 (R/W  32) Global State Register */
  __IO  uint32_t                       UDP_FADDR;          /**< Offset: 0x08 (R/W  32) Function Address Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       UDP_IER;            /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       UDP_IDR;            /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       UDP_IMR;            /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       UDP_ISR;            /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __O   uint32_t                       UDP_ICR;            /**< Offset: 0x20 ( /W  32) Interrupt Clear Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       UDP_RST_EP;         /**< Offset: 0x28 (R/W  32) Reset Endpoint Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       UDP_CSR[6];         /**< Offset: 0x30 (R/W  32) Endpoint Control and Status Register 0 */
  __I   uint8_t                        Reserved4[0x08];
  __IO  uint32_t                       UDP_FDR[6];         /**< Offset: 0x50 (R/W  32) Endpoint FIFO Data Register 0 */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       UDP_TXVC;           /**< Offset: 0x74 (R/W  32) Transceiver Control Register */
} udp_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_UDP_COMPONENT_H_ */
